# Goals:

### Create a banking database in PostgreSQL
### Create DDL for the banking database
### Add data to the database

### Query the database to address the following statements:

- Write a query to find the cust_ID and customer name of each customer at
the bank who only has a loan at the bank, and no account.


- Write a query to find the cust_ID and customer name of each customer who
lives on the same street and in the same city as customer ‘12345’.
Include customer ‘12345’ in your query results.   


- Write a query to find the name of each branch that has at least one customer
who has an account in the bank and who lives in “Harrison”

In [17]:
import psycopg2
import pandas as pd

In [18]:
# connecting to postgresql database
pgconn = psycopg2.connect(
    host="localhost",
    user="postgres",
    password="****!")

In [19]:
pgcursor = pgconn.cursor()

In [20]:
# changing isolation level to add autocommit. this will allow me to create a database in postgresql

from psycopg2.extensions import ISOLATION_LEVEL_AUTOCOMMIT 

pgconn.set_isolation_level(ISOLATION_LEVEL_AUTOCOMMIT)

## Create a banking database in PostgreSQL

In [21]:
# creating database

pgcursor.execute('CREATE DATABASE bank')

In [22]:
# closing connection to database. preparing to connect to the bank database i just created
pgconn.close()

In [23]:
# install sql alchemy if not alreadu downloaded:

#pip install sql alchemy

In [24]:
# connecting directly to database I just created

pgconn = psycopg2.connect(
    host="localhost",
    database ='bank',
    user="postgres",
    password="****!")

In [25]:
from sqlalchemy import create_engine

# connection string:

engine = create_engine('postgresql+psycopg2://postgres:****!@localhost/bank')

In [26]:
pgconn = engine.connect()

## Create DDL for the banking database

In [27]:
pgconn.execute('''CREATE TABLE IF NOT EXISTS branch(
                    branch_name        varchar(40) NOT NULL,
                    branch_city        varchar(40),
                    assets             numeric(16,2) CONSTRAINT branch_assets CHECK(assets > 0.0),
                    
                    CONSTRAINT         branch_pkey PRIMARY KEY (branch_name),
                    
                    CONSTRAINT         branch_cityCheck CHECK(branch_city IN ('Brooklyn','Bronx','Manhattan',
                                       'Yonkers'))
);

                    CREATE TABLE customer(
                    cust_ID            varchar(40) NOT NULL,
                    customer_name      varchar(40) NOT NULL,
                    customer_street    varchar(40),
                    customer_city      varchar(40),
                    
                    CONSTRAINT customer_pkey PRIMARY KEY (cust_ID)
);

                    CREATE TABLE loan(
                    loan_number        varchar(40),
                    branch_name        varchar(40),
                    amount             numeric(16,2) DEFAULT 0.0,
                    
                    CONSTRAINT loan_amount CHECK(amount >= 0.0),
                    
                    CONSTRAINT loan_pkey PRIMARY KEY (loan_number),
                    
                    CONSTRAINT loan_fkey_1 FOREIGN KEY (branch_name)
                      REFERENCES branch (branch_name)
                      ON UPDATE CASCADE
                      ON DELETE CASCADE
);

                    CREATE TABLE borrower(
                    cust_ID            varchar(40),
                    loan_number        varchar(40),
                    
                    CONSTRAINT borrower_pkey PRIMARY KEY (cust_ID, loan_number),
                    
                    CONSTRAINT borrower_fkey_1 FOREIGN KEY (cust_ID)
                      REFERENCES customer (cust_ID)
                      ON UPDATE CASCADE
                      ON DELETE CASCADE,
                      
                    CONSTRAINT loan_fkey_2 FOREIGN KEY (loan_number)
                      REFERENCES loan (loan_number)
                      ON UPDATE CASCADE
                      ON DELETE CASCADE
);

                    CREATE TABLE account(
                    account_number     varchar(40),
                    branch_name        varchar(40),
                    balance            numeric(16,2) CONSTRAINT account_balance CHECK(balance > 0.0),
                    
                    CONSTRAINT account_pkey PRIMARY KEY (account_number),
                    
                    CONSTRAINT account_fkey_1 FOREIGN KEY (branch_name)
                      REFERENCES branch (branch_name)
                      ON UPDATE CASCADE
                      ON DELETE CASCADE
);

                    CREATE TABLE depositor(
                    cust_ID            varchar(40),
                    account_number     varchar(40),
                    
                    CONSTRAINT depositor_pkey PRIMARY KEY (cust_ID, account_number),
                    
                    CONSTRAINT depositor_fkey_1 FOREIGN KEY (cust_ID)
                      REFERENCES customer (cust_ID)
                      ON UPDATE CASCADE
                      ON DELETE CASCADE,
                      
                    CONSTRAINT depositor_key_2 FOREIGN KEY (account_number)
                      REFERENCES account (account_number)
                      ON UPDATE CASCADE
                      ON DELETE CASCADE
);

''')

## Add data to the database

In [28]:
pgconn.execute('''
                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('Brooklyn Bank','Brooklyn','2506789.00');

                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('First Bank of Brooklyn','Brooklyn','4738291.00');

                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('Brooklyn Bridge Bank','Brooklyn','3216549.00');

                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('Bronx Federal Credit Union','Bronx','1425365.00');

                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('Big Bronx Bank','Bronx','5632897.00');

                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('Upper East Federal Credit Union','Manhattan','9385274.00');

                INSERT INTO branch (branch_name, branch_city, assets)
                VALUES ('Yonkahs Bankahs','Yonkers','2356967.00');

                -- Insert Values into customer --

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('12345', 'Billy Boi', '123 Easy Street', 'Bronx');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('54321', 'Teddy Tiger', '56 East Baltimore Road', 'Brooklyn');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('98524', 'Betty Bench', '123 Easy Street', 'Bronx');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('24357', 'Walter Halter', '67 Stupid Street', 'Brooklyn');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('73194', 'Wendy Winks', '78 Gold Street', 'Harrison');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('74185', 'Lauren Lawn', '3 Gravy Avenue', 'Yonkers');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('95124', 'Peter Pretender', '85 West Fourth Road', 'Manhattan');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('86753', 'Susan Sits', '123 Easy Street', 'Bronx');

                INSERT INTO customer (cust_ID, customer_name, customer_street, customer_city)
                VALUES ('77776', 'Hank Handles', '2 Ford Drive', 'Harrison');

                -- Insert Values into loan

                INSERT INTO loan (loan_number, branch_name, amount)
                VALUES ('462882645', 'Brooklyn Bridge Bank', '7500.00');

                INSERT INTO loan (loan_number, branch_name, amount)
                VALUES ('888512347', 'Bronx Federal Credit Union', '11500.00');

                INSERT INTO loan (loan_number, branch_name, amount)
                VALUES ('646469321', 'Upper East Federal Credit Union', '8550.00');

                INSERT INTO loan (loan_number, branch_name, amount)
                VALUES ('774485962', 'Yonkahs Bankahs', '2000.00');

                INSERT INTO loan (loan_number, branch_name, amount)
                VALUES ('919137375', 'Brooklyn Bank', '5000.00');

                -- Insert Values into borrower

                INSERT INTO borrower (cust_ID, loan_number)
                VALUES ('54321','888512347');

                INSERT INTO borrower (cust_ID, loan_number)
                VALUES ('95124','888512347');

                INSERT INTO borrower (cust_ID, loan_number)
                VALUES ('24357','919137375');

                INSERT INTO borrower (cust_ID, loan_number)
                VALUES ('77776','462882645');

                INSERT INTO borrower (cust_ID, loan_number)
                VALUES ('98524','774485962');

                -- Insert Values into account

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('142375689', 'First Bank of Brooklyn', '2003.64');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('741852963', 'Yonkahs Bankahs', '5263.23');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('159263487', 'Brooklyn Bank', '1425.98');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('963852741', 'Upper East Federal Credit Union', '2598.36');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('846275315', 'Brooklyn Bridge Bank', '688.12');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('258258963', 'Bronx Federal Credit Union', '3256.21');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('232154689', 'Big Bronx Bank', '4152.87');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('222456197', 'Bronx Federal Credit Union', '1234.56');

                INSERT INTO account (account_number, branch_name, balance)
                VALUES ('774436581', 'Brooklyn Bank', '8259.34');

                -- Insert Values into depositor

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('77776', '774436581');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('24357', '222456197');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('86753', '232154689');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('74185', '258258963');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('12345', '142375689');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('73194', '741852963');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('12345', '846275315');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('77776', '963852741');

                INSERT INTO depositor (cust_ID, account_number)
                VALUES ('12345', '159263487');
                
''')

### Write a query to find the cust_ID and customer name of each customer at the bank who only has a loan at the bank, and no account.

In [29]:
pd.read_sql_query('''SELECT cust_id, customer_name
                     FROM customer
                     WHERE cust_id IN ( SELECT cust_id
                                        FROM borrower
                                        EXCEPT
                                        SELECT cust_id
                                        FROM depositor);''', engine)

  cust_id    customer_name
0   54321      Teddy Tiger
1   98524      Betty Bench
2   95124  Peter Pretender

### Write a query to find the cust_id and customer name of each customer who lives on the same street and in the same city as customer ‘12345’. Include customer ‘12345’ in your query results.

In [30]:
pd.read_sql_query('''   SELECT cust_id, customer_name
                        FROM customer
                        WHERE customer_street IN   (SELECT customer_street
                                                   FROM customer
                                                   WHERE cust_id = '12345')
                                        AND customer_city IN
                                                   (SELECT customer_city
                                                    FROM customer
                                                    WHERE cust_id = '12345');
''', engine)

  cust_id customer_name
0   12345     Billy Boi
1   98524   Betty Bench
2   86753    Susan Sits

### Write a query to find the name of each branch that has at least one customer who has an account in the bank and who lives in “Harrison".

In [64]:
pd.read_sql_query('''   SELECT branch_name
                        FROM account NATURAL JOIN depositor NATURAL JOIN customer
                        WHERE customer_city ='Harrison' AND depositor.account_number is NOT NULL;

''', engine)

                       branch_name
0                  Yonkahs Bankahs
1                    Brooklyn Bank
2  Upper East Federal Credit Union